dwijaybane/msp430/Source Files/eusci_i2c.c
   // Enabling I2C Mode
   EUSCI_I2C_enable(EUSCI_B0_BASE);
}

void WriteDataI2C(unsigned int address, unsigned char data)
{
	 EUSCI_I2C_setMode(EUSCI_B0_BASE, EUSCI_I2C_TRANSMIT_MODE);
	 EUSCI_I2C_masterMultiByteSendStart(EUSCI_B0_BASE,(address>>8));
	 Delay_Ms(50);
	 EUSCI_I2C_masterMultiByteSendNext(EUSCI_B0_BASE,(address & 0xFF));
	 Delay_Ms(50);
	 EUSCI_I2C_masterMultiByteSendFinish(EUSCI_B0_BASE,data);
	 Delay_Ms(100);

}

unsigned char ReadDataI2C(unsigned int address)
{

	EUSCI_I2C_masterMultiByteSendStart(EUSCI_B0_BASE,(address>>8));
	Delay_Ms(50);
	EUSCI_I2C_masterMultiByteSendNext(EUSCI_B0_BASE,(address>>8));
	Delay_Ms(50);
	EUSCI_I2C_masterMultiByteSendFinish(EUSCI_B0_BASE,address);
	Delay_Ms(100);
	EUSCI_I2C_setMode(EUSCI_B0_BASE, EUSCI_I2C_RECEIVE_MODE);

	EUSCI_I2C_masterReceiveStart(EUSCI_B0_BASE);
	Delay_Ms(50);
  	EUSCI_I2C_masterMultiByteReceiveStop(EUSCI_B0_BASE);
  	while(!EUSCI_I2C_getInterruptStatus(EUSCI_B0_BASE,EUSCI_I2C_RECEIVE_INTERRUPT0));
    return EUSCI_I2C_masterSingleReceive(EUSCI_B0_BASE);
}

void WriteDataStringI2C(unsigned int address, unsigned char data[])
{
				unsigned int i = 0;
				EUSCI_I2C_setMode(EUSCI_B0_BASE, EUSCI_I2C_TRANSMIT_MODE);
				EUSCI_I2C_masterMultiByteSendStart(EUSCI_B0_BASE,(address>>8));
			//	Delay_Ms(1);
				EUSCI_I2C_masterMultiByteSendNext(EUSCI_B0_BASE,(address & 0xFF));
			//	Delay_Ms(1);
				do
				{
				EUSCI_I2C_masterMultiByteSendNext(EUSCI_B0_BASE,data[pankil]);
			//	Delay_Ms(1);
				i++;
				pankil++;
				i2c_eeprom_add++;
				if((i > 62) || (i2c_eeprom_add%64 ==0 && i!=0))
				{
					goto PAGE_END;
				}
				}while (data[pankil] != '\0');
				pankil = 0;
PAGE_END:		EUSCI_I2C_masterMultiByteSendFinish(EUSCI_B0_BASE,data[pankil]);
				//i2c_eeprom_add = i2c_eeprom_add + pankil;
			//	Delay_Ms(1);
}

void ReadDataStringI2C(unsigned int address, unsigned char*rxd, unsigned int length)
{

    EUSCI_I2C_masterMultiByteSendStart(EUSCI_B0_BASE,(address>>8));
    Delay_Ms(1);
    EUSCI_I2C_masterMultiByteSendNext(EUSCI_B0_BASE,(address>>8));
    Delay_Ms(1);
    EUSCI_I2C_masterMultiByteSendFinish(EUSCI_B0_BASE,address);
    Delay_Ms(1);
    EUSCI_I2C_setMode(EUSCI_B0_BASE, EUSCI_I2C_RECEIVE_MODE);
    EUSCI_I2C_masterReceiveStart(EUSCI_B0_BASE);
    while(length--)
    {
    while(!EUSCI_I2C_getInterruptStatus(EUSCI_B0_BASE,EUSCI_I2C_RECEIVE_INTERRUPT0));
    Delay_Ms(1);
    *rxd=EUSCI_I2C_masterMultiByteReceiveNext (EUSCI_B0_BASE);
     rxd++;
    }
    *rxd='\0';
    EUSCI_I2C_masterMultiByteReceiveStop(EUSCI_B0_BASE);

}

void Display_I2C_Data(unsigned int start_add,unsigned int end_add)
{
	unsigned char RXData[270];
	unsigned int i;
	unsigned int page;
	unsigned int page_req = 'N';

	while(end_add > start_add)
	{
		while(page_req != 'N');
		{
			ReadDataStringI2C(start_add,RXData,256);						// Reading Data From EEPROM
			for(i=0;i<256;i++)
			{
				if(end_add > start_add)
				{
					if(i%16 == 0)
					{
						printf("\n\r");
						printf("%x04\t",start_add);
					}
				}
				else
				{
					return;
				}
				printf("%x02  ",RXData[i]);
				start_add++;
				//Delay_Ms(1);
			}
			page_req = 0;
			if(end_add > start_add)
			{
				printf("\n\rCurrent Page Displayed Correctly\n\rPress N for Next Page\n\r");
				page_req = getche();
				printf("\x1b[2J");
				start_add++;
			}
		}
	}
}
int my_strCmp (unsigned char *s,unsigned char *t)
{
	while (*t!='\0')
	{
		if (*t==*s )
		{
			s++;
			t++;
		}
		else
		{
			return(0);
		}
	}
	return(1);
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
